In [1]:
%matplotlib inline
import pandas as pd

In [2]:
# from IPython.core.display import HTML
# css = open('style-table.css').read() + open('style-notebook.css').read()
# HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('E:/Lets_Upgrade/Assignments/Day 16-17/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
titles.shape

(244914, 2)

In [5]:
print("No. of listed movies : ", titles.shape)

No. of listed movies :  (244914, 2)

### What are the earliest two films listed in the titles dataframe?

In [6]:
earliest_2 = titles.sort_values(by='year',ascending=True)[0:2]

In [7]:
print("Earliest two films are : ", earliest_2)

Earliest two films are :                       title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [13]:
ham = titles[titles['title'] == 'Hamlet']

In [9]:
print('movies have the title "Hamlet" are : ',len(titles[titles['title'] == 'Hamlet']))

movies have the title "Hamlet" are :  20

### How many movies are titled "North by Northwest"?

In [10]:
titles[titles['title'] == 'North by Northwest']

                    title  year
74398  North by Northwest  1959

In [11]:
print('movies are titled "North by Northwest" : ', len(titles[titles['title'] == 'North by Northwest']))

movies are titled "North by Northwest" :  1

### When was the first movie titled "Hamlet" made?

In [14]:
ham.sort_values(by='year', ascending=True)[0:1]

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [15]:
treasure = titles[titles['title'] == 'Treasure Island']

In [16]:
treasure.sort_values(by='year', ascending=True)

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [17]:
fifty = titles[titles['year'] == 1950]

In [18]:
print('movies were made in the year 1950 : ',len(fifty))

movies were made in the year 1950 :  1113

### How many movies were made in the year 1960?

In [19]:
sixty = titles[titles['year'] == 1960]

In [20]:
print('movies were made in the year 1960 : ',len(sixty))

movies were made in the year 1960 :  1549

### How many movies were made from 1950 through 1959?

In [21]:
fifty_to_fifty_nine = titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

In [22]:
print('movies were made from 1950 through 1959 : ', len(fifty_to_fifty_nine))

movies were made from 1950 through 1959 :  12934

### In what years has a movie titled "Batman" been released?

In [23]:
titles[titles['title'] == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?